book/assets/assessments/githubPullRequestAssmnt.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-13 Mon 11:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Git Pull Request and Issues Assessment</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Git Pull Request and Issues Assessment</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5af9e76">1. Task</a></li>
<li><a href="#org2597897">2. Comment</a></li>
<li><a href="#org2375ab0">3. Steps (video: steps illustrated)</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5af9e76" class="outline-2">
<h2 id="org5af9e76"><span class="section-number-2">1.</span> Task</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Generate a pull request for the <a href="https://github.com/brittAnderson/psych363Practice">psych363Practice</a> repository on Github.</li>
<li>Generate an issue for the psych363Practice repository.</li>
</ol>
</div>
</div>

<div id="outline-container-org2597897" class="outline-2">
<h2 id="org2597897"><span class="section-number-2">2.</span> Comment</h2>
<div class="outline-text-2" id="text-2">
<p>
This course makes use of <a href="https://github.com">github</a> for practicing how to use the version control program git. An important part of collaborating on code (or other material hosted on github, which might include text files) is to be able to give back or to alert the owner to a problem. This requires that you can both generate a <b>pull request</b> and that you can <b>open an issue.</b>
</p>
</div>
</div>

<div id="outline-container-org2375ab0" class="outline-2">
<h2 id="org2375ab0"><span class="section-number-2">3.</span> Steps (<a href="https://vimeo.com/channels/i2c4p/456349516">video: steps illustrated</a>)</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Previously you should have <i>forked</i> the psych363Practice repository.</li>
<li>Next you will need to clone your fork to your laptop.</li>
<li>Check that you have your fork as a <i>remote.</i></li>
<li>Add <b>my original</b> version of the repository as a second remote.</li>
<li>To make sure you have the latest code, including all the other pulls generated by other students in the course you will want to:
<ol class="org-ol">
<li><i>Pull</i> from <b>my original</b> repo.</li>
<li>Accept and merge the changes if necessary.</li>
<li><i>Push</i> these new changes to <b>your fork</b> on github.</li>
<li>Verify the new changes made it there by looking at your fork in your browser. You may have to refresh your browser to see the changes.</li>
<li>Now, in the <code>gitnames</code> subdirectory add a file with &lt;yourfirstname&gt;.txt. Put some simple sentence in it.</li>
<li><b>Add</b> this file.</li>
<li><b>Commit</b> this change.</li>
<li><i>Push</i> to your fork.</li>
<li>In your web browser initiate a <b>pull request.</b></li>
</ol></li>
<li>When I receive your pull request I will accept it and give you half credit for this assignment (if you are a UWloo student).</li>
<li>Next, open an <i>issue.</i> Just give it a simple title and make a simple statement. Our goal is to practice the process. Note the number of your issue and upload this number to the dropbox with your github name so I can match issues and pull requests to students.</li>
</ol>

<p>
Important Note: To help each other learn how to use git, github, and
the material of this course, whether or not you are a UWaterloo
student, use the <a href="https://github.com/brittAnderson/Intro2Computing4Psychology/issues">issue function in the Intro2Computing4Psychology</a>
repository to report your problems and confusions. That issue record
will persist for future visitors to the repo who have the same
question see how we dealt with it.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-02-13 Mon 11:16</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>